# #주급계산 이름, 근무시간, 시간당 급여액 - 5명에 대해여
# 홍길동 40 10000
# 임꺽정 30 20000
# 장길산 20 20000
# 홍경래 10 15000
# 이진옥 20 30000

#강사님 풀이 방법



# # #GPT 풀이 방법

# name_list = ["홍길동", "임꺽정", "장길산", "홍경래", "이진옥"]
# work_time = [40, 30, 20, 10, 20]
# hour_pay = [10000, 20000, 20000, 15000, 30000]

# for i in range(5):
#     name = name_list[i]
#     work = work_time[i]    # ✅ 리스트 work_time에서 꺼내
#     pay = hour_pay[i]      # ✅ 리스트 hour_pay에서 꺼내
#     weekly_pay = work * pay
#     print(f"{name}의 주급은 {weekly_pay}원입니다.")


# #입력값 (내가한거))
# name_list = ["홍길동", "임꺽정", "장길산", "홍경래", "이진옥"]
# work_time = [40, 30, 20, 10, 20]
# hour_pay = [10000, 20000, 20000, 15000, 30000]

# dic = {"홍길동" : 40,"임꺽정" : 30 ,"장길산" : 20,"홍경래" : 10,"이진옥" : 20}

# i = input("이름은?")
# for i in dic:
#     if dic["홍길동"]:
#         print()